In [9]:
#Create a database called temp_db. Open a cursor to this newly created database.


import sqlite3
con=sqlite3.connect('temp_db')
cursorobj=con.cursor()
con.commit()
con.close()

In [10]:
#In the database temp_db created in Q.No.1, create a table

import sqlite3
con=sqlite3.connect('temp_db')
c=con.cursor()

c.execute('''
          CREATE TABLE IF NOT EXISTS emp
          ([empno] INTEGER PRIMARY KEY , [ename] TEXT,[salary] REAL,[deptno] TEXT)
          ''')
          

con.commit()
con.close()

In [18]:
#In the emp table created in Q.No. 2, insert any five records.

import sqlite3
con=sqlite3.connect('temp_db')
c=con.cursor()

c.execute('''
          CREATE TABLE IF NOT EXISTS emp
          ([empno] INTEGER PRIMARY KEY , [ename] TEXT,[salary] REAL,[deptno] TEXT)
          ''')
  
c.execute('''
          INSERT INTO emp (empno,ename, salary,deptno)

                VALUES
                (21,'Rehan',10000,10),
                (22,'Mahfooz',15000,20),
                (23,'Zaid',20000,30),
                (24,'Ahyan',22000,40),
                (25,'Mizan',30000,10)
          ''')

con.commit()
con.close()

In [31]:
#From the emp table, display all the records.

import sqlite3
def View1():
    con=sqlite3.connect('temp_db')
    c=con.cursor()
    c.execute('select * FROM emp')
    r=c.fetchall()
    con.commit()
    con.close()
    return r

View1()

[(1, 'Rehan', 10000.0, '101'),
 (2, 'Raza', 20000.0, '201'),
 (3, 'Zaid', 30000.0, '301'),
 (4, 'Ahyan', 40000.0, '401'),
 (5, 'Waquar', 50000.0, '501'),
 (6, 'Rehan', 10000.0, '101'),
 (7, 'Raza', 20000.0, '201'),
 (8, 'Zaid', 30000.0, '301'),
 (9, 'Ahyan', 40000.0, '401'),
 (10, 'Waquar', 50000.0, '501'),
 (11, 'Rehan', 10000.0, '101'),
 (12, 'Raza', 20000.0, '201'),
 (13, 'Zaid', 30000.0, '301'),
 (14, 'Ahyan', 40000.0, '401'),
 (15, 'Waquar', 50000.0, '501'),
 (16, 'Rehan', 10000.0, '10'),
 (17, 'Raza', 15000.0, '20'),
 (19, 'Ahyan', 22000.0, '40'),
 (20, 'Waquar', 30000.0, '10'),
 (21, 'Rehan', 10000.0, '10'),
 (22, 'Mahfooz', 15000.0, '20'),
 (24, 'Ahyan', 22000.0, '40'),
 (25, 'Mizan', 30000.0, '10')]

In [26]:
#From the emp table, display the records of only those employees


import sqlite3
def View2():
    con=sqlite3.connect('temp_db')
    c=con.cursor()
    c.execute('select * FROM emp where salary>15000 and deptno=10')
    r=c.fetchall()
    con.commit()
    con.close()
    return r

View2()

[(20, 'Waquar', 30000.0, '10'), (25, 'Mizan', 30000.0, '10')]

In [25]:
#From the emp table, display the records of only those employees 

import sqlite3
def View3():
    con=sqlite3.connect('temp_db')
    c=con.cursor()
    c.execute('select * FROM emp where salary>20000 and salary<25000 and deptno!=10')
    r=c.fetchall()
    con.commit()
    con.close()
    return r

View3()

[(19, 'Ahyan', 22000.0, '40'), (24, 'Ahyan', 22000.0, '40')]

In [24]:
#From the emp table, display the records of only those employees whose name begins with M.

import sqlite3
def View4():
    con=sqlite3.connect('temp_db')
    c=con.cursor()
    c.execute('select * FROM emp where ename like "M%" ')
    r=c.fetchall()
    con.commit()
    con.close()
    return r

View4()

[(22, 'Mahfooz', 15000.0, '20'), (25, 'Mizan', 30000.0, '10')]

In [7]:
#In the emp table, delete the records of those employees who belong to deptno 30
 
import sqlite3
def View5():
    con=sqlite3.connect('temp_db')
    c=con.cursor()
    c.execute('delete FROM emp where deptno=30 ')
    r=c.fetchall()
    con.commit()
    con.close()
    return r

def View1():
    con=sqlite3.connect('temp_db')
    c=con.cursor()
    c.execute('select * FROM emp')
    r=c.fetchall()
    con.commit()
    con.close()
    return r

View5()    
View1()

[(1, 'Rehan', 12100.0, '101'),
 (2, 'Raza', 22000.0, '201'),
 (3, 'Zaid', 30000.0, '301'),
 (4, 'Ahyan', 40000.0, '401'),
 (5, 'Waquar', 50000.0, '501'),
 (6, 'Rehan', 10000.0, '101'),
 (7, 'Raza', 20000.0, '201'),
 (8, 'Zaid', 30000.0, '301'),
 (9, 'Ahyan', 40000.0, '401'),
 (10, 'Waquar', 50000.0, '501'),
 (11, 'Rehan', 10000.0, '101'),
 (12, 'Raza', 20000.0, '201'),
 (13, 'Zaid', 30000.0, '301'),
 (14, 'Ahyan', 40000.0, '401'),
 (15, 'Waquar', 50000.0, '501'),
 (16, 'Rehan', 10000.0, '10'),
 (17, 'Raza', 15000.0, '20'),
 (19, 'Ahyan', 22000.0, '40'),
 (20, 'Waquar', 30000.0, '10'),
 (21, 'Rehan', 10000.0, '10'),
 (22, 'Mahfooz', 15000.0, '20'),
 (24, 'Ahyan', 22000.0, '40'),
 (25, 'Mizan', 30000.0, '10')]

In [6]:
#In the emp table, update the salary of an employee by 10 % by accepting the empno from the user.

import sqlite3
def View6(e):
    con=sqlite3.connect('temp_db')
    c=con.cursor()
    c.execute('UPDATE emp SET salary = salary + (salary * 0.1) WHERE empno = ?',(e,))
    r=c.fetchall()
    con.commit()
    con.close()
    return r

def View1():
    con=sqlite3.connect('temp_db')
    c=con.cursor()
    c.execute('select * FROM emp')
    r=c.fetchall()
    con.commit()
    con.close()
    return r
              
id=int(input('Enter employee ID:'))
View6(id) 
View1()

Enter employee ID:2

[(1, 'Rehan', 12100.0, '101'),
 (2, 'Raza', 22000.0, '201'),
 (3, 'Zaid', 30000.0, '301'),
 (4, 'Ahyan', 40000.0, '401'),
 (5, 'Waquar', 50000.0, '501'),
 (6, 'Rehan', 10000.0, '101'),
 (7, 'Raza', 20000.0, '201'),
 (8, 'Zaid', 30000.0, '301'),
 (9, 'Ahyan', 40000.0, '401'),
 (10, 'Waquar', 50000.0, '501'),
 (11, 'Rehan', 10000.0, '101'),
 (12, 'Raza', 20000.0, '201'),
 (13, 'Zaid', 30000.0, '301'),
 (14, 'Ahyan', 40000.0, '401'),
 (15, 'Waquar', 50000.0, '501'),
 (16, 'Rehan', 10000.0, '10'),
 (17, 'Raza', 15000.0, '20'),
 (19, 'Ahyan', 22000.0, '40'),
 (20, 'Waquar', 30000.0, '10'),
 (21, 'Rehan', 10000.0, '10'),
 (22, 'Mahfooz', 15000.0, '20'),
 (24, 'Ahyan', 22000.0, '40'),
 (25, 'Mizan', 30000.0, '10')]

In [9]:
#Delete the emp table.


def drop():
    con=sqlite3.connect('temp_db')
    c=con.cursor()
    c.execute('drop table emp')
    con.commit()
    con.close()
    

drop()

OperationalError: no such table: emp